package hw.hw2;

/*
Выполните следующие инструкции:
Создайте программу, чтобы вывести строку "Привет, мир! Я изучаю Java." в консоль.
Добавьте в вашу программу однострочный комментарий.
Добавьте в вашу программу многострочный комментарий.
 */
public class Task1 {
    public static void main(String[] args) {
        // information output
        System.out.println("Привет, мир! Я изучаю Java.");
    }
}
