package hw.hw5;

/*
1. Напишите программу, чтобы проверить значения длины и ширины прямоугольника и определить, является ли он квадратным или нет.
 */
public class Task1 {
    public static void main(String[] args) {
        int a = 6;
        int b = 6;

        if (a == b) {
            System.out.println("стороны равны");
        } else {
            System.out.println("стороны не равны");
        }
    }
}
